In [1]:
from datascience import *
import numpy as np

%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')

## Lesson 10: Groups ##

## Grouping by One Column ##

In [2]:
cones = Table.read_table('data/cones.csv')

In [3]:
cones

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
bubblegum  | pink        | 4.75

In [4]:
cones.group('Flavor')

Flavor     | count
bubblegum  | 1
chocolate  | 3
strawberry | 2

In [5]:
cones.drop('Color').group('Flavor', np.average)

Flavor     | Price average
bubblegum  | 4.75
chocolate  | 5.08333
strawberry | 4.4

In [6]:
cones.drop('Color').group('Flavor', min)

Flavor     | Price min
bubblegum  | 4.75
chocolate  | 4.75
strawberry | 3.55

## Lists

In [7]:
[1, 5, 'hello', 5.0]

[1, 5, 'hello', 5.0]

In [8]:
[1, 5, 'hello', 5.0, make_array(1,2,3)]

[1, 5, 'hello', 5.0, array([1, 2, 3])]

## Grouping by Two Columns ##

In [19]:
nba = Table.read_table('data/nba_salaries.csv').relabeled("'15-'16 SALARY", 'SALARY')
nba

PLAYER           | POSITION | TEAM          | SALARY
Paul Millsap     | PF       | Atlanta Hawks | 18.6717
Al Horford       | C        | Atlanta Hawks | 12
Tiago Splitter   | C        | Atlanta Hawks | 9.75625
Jeff Teague      | PG       | Atlanta Hawks | 8
Kyle Korver      | SG       | Atlanta Hawks | 5.74648
Thabo Sefolosha  | SF       | Atlanta Hawks | 4
Mike Scott       | PF       | Atlanta Hawks | 3.33333
Kent Bazemore    | SF       | Atlanta Hawks | 2
Dennis Schroder  | PG       | Atlanta Hawks | 1.7634
Tim Hardaway Jr. | SG       | Atlanta Hawks | 1.30452
... (407 rows omitted)

In [20]:
nba.group(['TEAM','POSITION'])

TEAM           | POSITION | count
Atlanta Hawks  | C        | 3
Atlanta Hawks  | PF       | 2
Atlanta Hawks  | PG       | 2
Atlanta Hawks  | SF       | 2
Atlanta Hawks  | SG       | 5
Boston Celtics | C        | 3
Boston Celtics | PF       | 2
Boston Celtics | PG       | 4
Boston Celtics | SF       | 2
Boston Celtics | SG       | 4
... (137 rows omitted)

In [21]:
nba.drop('PLAYER').group(['TEAM','POSITION'], np.sum)

TEAM           | POSITION | SALARY sum
Atlanta Hawks  | C        | 22.7563
Atlanta Hawks  | PF       | 22.005
Atlanta Hawks  | PG       | 9.7634
Atlanta Hawks  | SF       | 6
Atlanta Hawks  | SG       | 9.04846
Boston Celtics | C        | 7.3514
Boston Celtics | PF       | 6.17096
Boston Celtics | PG       | 19.8986
Boston Celtics | SF       | 8.83432
Boston Celtics | SG       | 8.03022
... (137 rows omitted)